#### BuiltInFailures.LinkFailures Members

---

|  |
| --- |
| BuiltInFailures LinkFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures LinkFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CannotModifyLinkedFile | Shared Sites in the link ""%1!s!"" cannot be modified. |
| Public property Static member | CannotOpenLinkedFileServerFound | Cannot open the linked model using Open and Unload because the plugin [name] provided by [vendor] experienced an error. For more information please contact [vendor]. |
| Public property Static member | CannotOpenLinkedFileServerNotFound | Cannot open the linked model using Open and Unload because the plugin [name] cannot be accessed. Please check plugin [name], which has server Id [serverId] |
| Public property Static member | CannotPublishSharedCoordinatesToMirroredNonRevitLinks | Shared coordinates cannot be published to mirrored, non Revit, links. |
| Public property Static member | CannotReloadFile | Can't reload file. |
| Public property Static member | CannotUnlinkFile | Can't unlink file. |
| Public property Static member | DataDictionaryDifferentInLink | Linked file [Name] was last saved in a previous version of Revit. Changes to it cannot be saved until it is upgraded. |
| Public property Static member | DeleteLinkSymbolPrompt | All instances of Linked Model '[Name]' have been deleted, but the file itself is still loaded. Remove the Linked File using Manage Links dialog to save memory unless you are going to reuse it in this project. Removing the Link cannot be undone. |
| Public property Static member | LinkedFileOpenInOtherDoc | Linked file cannot be reloaded because it is loaded into another open document. |
| Public property Static member | LinkInstanceNeedsReconcile | Instance of linked .rvt file needs Coordination Review |
| Public property Static member | ModifiedLinkedFile | Shared Sites in the link have been modified, use move instance to reset the change. |
| Public property Static member | ModifyingLinkedFile | Shared Locations in the Linked Model '[Name]' have been modified, but not saved back to the Linked File. Upon reopening, instances of the Linked Model will return to their last Saved Positions. You can Save the Linked Model later via the Manage Links dialog. |
| Public property Static member | MultipleLinks | Can't complete operation. Linked Files have the same name. |
| Public property Static member | NoConstraintsToLinks1 | Constraints may not be created to linked instances using Shared Locations. Constraints will be removed. |
| Public property Static member | SourceFileDrivenByOtherTarget | Linked Model's Shared Coordinates have been modified via another host model in this session. In order to be able to change the Linked File via the active host model, Save and open it again in a new session. |
| Public property Static member | WatchedLinkMoved | Monitored Link moved. |

# See Also

BuiltInFailures LinkFailures Class

Autodesk.Revit.DB Namespace